public class Variable {
	public static void main(String[] args) {

		/* TODO: Создайте класс Variable с методом main. 
		Объявите в методе переменные всех существующих в Java примитивных типов данных.
		Каждой переменной присвойте значение. 
		В качестве значений используйте информацию о своем компьютере: количество ядер, частота процессора и тд.
		Выведите все значения переменных на консоль.
		*/


		byte a1 = 4;
		short a2 = 2080;
		int a3 = 1000000;
		long a4 = 1122334454;
		float a5 = 8.1f;
		double a6 = 69.999;
		char a7 = 'q';
		boolean a8 = false;
		System.out.println("RAM " + a1);
		System.out.println("Graphics card RTX "+a2);
		System.out.println("hzhzhzhzhzh " +a3);
		System.out.println("bez ponyatiya "+a4);
		System.out.println("Windows "+a5);
		System.out.println("My PC price "+a6);
		System.out.println("Bonus "+a7);
		System.out.println("All games 60 fps "+a8);
	}
}